Revit 2026 API

# TextElementBaseDirection Property

---

Direction of the base line of the text element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ BaseDirection { get; }
```
```vb
Public ReadOnly Property BaseDirection As XYZ
	Get
```
```cpp
public:
property XYZ^ BaseDirection {
	XYZ^ get ();
}
```
```fsharp
member BaseDirection : XYZ with get
```

#### Property Value

XYZ

Base direction is always perpendicular to Up direction. Those two vectors together define the plane of the text.

#### Reference

TextElement Class

Autodesk.Revit.DB Namespace